Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་རྒྱ་མཚོ་ལ་རབ་ཏུ་ཞུགས་པ་ཡིན། བསམ་པ་བརྟན་པ་རྡོ་རྗེའི་ཁམས་ལྟ་བུས་ཡོངས་སུ་ཟིན་པའི་སེམས་དང་ལྡན་པས་ཤིན་ཏུ་བརྟན་པ་ཡིན། སྲིད་པའི་ལམ་གྱི་རྒྱུད་དུ་སྐྱེ་བ་ལས་ཕྱིན་ཕྱོགས་སུ་ཕྱོགས་པ་ཡིན། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་གྲུབ་པར་བྱ་བ་ལ་མངོན་དུ་གྱུར་པ་ཡིན། བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་རྣམ་པར་སྤེལ་བ་ལ་ཁྱད་པར་དུ་འབོགས་པ་རབ་ཏུ་ཐོབ་པ་ཡིན། ལྷག་པའི་བསམ་པ་ཤིན་ཏུ་འོད་གསལ་བར་བྱ་བའི་ཕྱིར་སེམས་ཤིན་ཏུ་དགེ་བ་ཡིན། སྨོན་ལམ་བརྟན་ཞིང་རྒྱ་ཆེ་བ་རྣམ་པར་འཕེལ་བར་བྱ་བ་ལ་མྱི་གཡོ་བ་ཡིན།
en: has attained the illumination of the enlightenment of buddhahood, has entered the ocean of the ways of a bodhisattva, has stability through having a mind that possesses the vajra element of a stable motivation, has turned away from rebirth in all states of existence, has turned toward the accomplishment of the miraculous manifestations of all the tathāgatas, has gained the special attainment for the increase of the faculties of a bodhisattva, has a virtuous mind in order to illuminate the superior motivation, is unshakable in increasing firm, vast prayers;

source: སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པར་གཏོར་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་དགོངས་པ་ཡིན། འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བས་མགོན་དུ་གྱུར་བ་ཡིན་ཏེ།
en: is focused on all the tathāgatas in order to destroy the mountain of all kleśas, and is a protector through taking care of all beings.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བཞི་པ་དུས་གསུམ་སྣང་བར་བྱ་བའི་ལྷག་པའི་བསམ་པ་རྣམ་པར་དག་པའི་སྙིང་པོ་ཞེས་བྱ་བའོ།
en: “Noble one, that is the fourth birth of a bodhisattva, called the essence of the pure, superior motivation that illuminates the three times

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ལྔ་པ་ཀུན་ནས་སྣང་བའི་འོད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the fifth birth of a bodhisattva, called the essence of all-illuminating light

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་རབ་ཏུ་ཞུགས་པས་སྦྱོར་བ་ཕུན་སུམ་ཚོགས་པ་ཡིན། སྦྱིན་པ་ལྷུག་པར་གཏོང་བས་དངོས་པོའི་འདུ་ཤེས་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པ་ཡིན། ཚུལ་ཁྲིམས་མཐའ་ཡས་པས་མཐའ་ལས་རྒལ་བར་རྣམ་པར་དག་པ་ཡིན། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་བཟོད་པའི་སྣང་བ་རབ་ཏུ་ཐོབ་པས། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་གནས་པའི་བཟོད་པ་དང་ལྡན་པ་ཡིན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡངས་པར་འབྱུང་བ་ལ་ཞུགས་པས་བརྩོན་འགྲུས་ཆེན་པོ་དང་ལྡན་པ་ཡིན། སྒོ་ཀུན་ཏུ་ལྟ་བའི་ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པས་བསམ་གཏན་ལ་རབ་ཏུ་བརྩོན་པ་ཡིན། ཆོས་སྣང་བ་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པས་ཤེས་རབ་ཀྱི་མཐུའི་འོད་དང་ལྡན་པ་ཡིན། སངས་རྒྱས་བལྟ་བ་རྒྱ་མཚོ་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལ་ཞུགས་པས་ཐོགས་པ་མེད་པའི་མིག་དང་ལྡན་པ་ཡིན། འཇིག་རྟེན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པས། ཆོས་ཐམས་ཅད་ཀྱི་དེ་ཁོ་ན་ཉིད་ལ་དབང་བསྒྱུར་བས་སྨོས་པ་ཡིན།
en: “Noble one, it is when a bodhisattva has perfect application because of engaging in ripening and guiding all beings, has unlimited generosity because of transcending all conceptions of things, has endless purity because of limitless correct conduct, has the patience that is from within the scope of the tathāgatas because of attaining the illumination of the patience toward phenomena of all the buddhas, has great diligence because of engaging in the arising of omniscience, has dedication to dhyāna because of purifying the domain of knowledge of every entrance to samādhi, has the light of diligence in wisdom because of attaining the illumination of all Dharmas, has unimpeded vision because of engaging in the perception of the ocean of visions of the buddhas, has power over the nature of all phenomena because of bringing satisfaction to all worlds, and has perfect application because of correct attainment of the way of the Dharma.

source: ཆོས་ཀྱི་ཚུལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཐོབ་པར་བྱ་བ་ལ་རབ་ཏུ་བརྩོན་པ་ཡིན་ཏེ། རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ལྔ་བ་ཀུན་ནས་སྣང་བའི་འོད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བའོ།
en: “Noble one, that is the fifth birth of a bodhisattva, called the essence of all-illuminating light

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་དྲུག་པ་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་རྒྱུད་དུ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the sixth birth of a bodhisattva, called the essence of the origin of the lineage of the tathāgata family

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་བྱུང་བ་ཡིན།
en: “Noble one, it is when a bodhisattva is born into the family of the tathāgatas;

source: དེ་བཞིན་གཤེགས་པའི་རྒྱུད་དུ་སྐྱེས་པ་ཡིན།
en: is born into the lineage of the tathāgatas;

source: ཚུལ་གྱི་སྒོ་ཐམས་ཅད་ལ་ཤིན་ཏུ་གྲུབ་པ་ཡིན། འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྨོན་ལམ་ཆེན་པོ་རྣམ་པར་དག་པ་ཡིན།
en: accomplishes every entranceway into the Dharma of the buddhas; becomes purified in the great prayers of all past, future, and present tathāgatas;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ལ་རང་བཞིན་གཅིག་པའི་དགེ་བའི་རྩ་བར་གྱུར་པ་ཡིན།
en: has roots of merit that have the same nature as the roots of merit of all tathāgatas;

source: སངས་རྒྱས་ཐམས་ཅད་དང་ལུས་གཅིག་ཏུ་གྱུར་པ་ཡིན།
en: has the same body as all buddhas;

source: ཆོས་དཀར་པོས་འཇིག་རྟེན་གཞན་དུ་འགྲོ་བ་ཡིན།
en: goes to other worlds through having good qualities;

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཡོངས་སུ་བསྟན་པའི་ཏིང་ངེ་འཛིན་ལ་བདག་ཉིད་ཆེ་བའི་ཆོས་ཀྱིས་རྣམ་པར་སྤྱོད་པ་ཡིན།
en: practices the greatness of the Dharma in the samādhi that has the vision of the blessing of the buddhas;

source: དུས་ལ་ཇི་ལྟར་བབ་པ་བཞིན་དུ་སེམས་ཅན་རྣམ་པར་དག་པར་བྱ་བའི་ཆོས་ལ་ཞུགས་པ་ཡིན། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་དྲིས་པ་ལ་སྤོབས་པ་རྒྱུན་མི་འཆད་པ་ཡིན་ཏེ།
en: and when the time comes engages in the Dharma that purifies beings with uninterrupted eloquence that asks Dharma questions.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་དྲུག་པ་དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་རྒྱུད་དུ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བའོ།
en: “Noble one, that is the sixth birth of a bodhisattva, called the essence of the origin of the lineage of the tathāgata family

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བདུན་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱི་འོད་སྣང་བའི་རྒྱན་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the seventh birth of a bodhisattva, called the essence of the adorning light that illuminates the strengths of the buddhas

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་སྟོབས་ལ་འཇུག་པའི་སྣང་བས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བ་ལས་ཕྱིར་མྱི་ལྡོག་གོ །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་རྒྱ་མཚོ་ལས་ཕྱིར་མི་འགྱུར་རོ། །ཆོས་ཐམས་ཅད་སྒྱུ་མའི་རྣམ་པ་ལྟར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པར་བྱ་བ་ལ་གནས་པས་ཡོངས་སུ་ཡི་འཆད་པར་མྱི་འགྱུར་རོ། །འཇིག་རྟེན་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུར་རབ་ཏུ་རྟོགས་པར་བྱེད་དོ། །གཟུགས་སུ་རྣམ་པར་དམྱིགས་པའི་གནས་ཐམས་ཅད་གཟུགས་བརྙན་ལྟ་བུར་མངོན་པར་སྒྲུབ་བོ། །མངོན་པར་ཤེས་པས་རྣམ་པར་འཕྲུལ་པ་སྤྲུལ་པ་ལྟ་བུ་ལ་དབང་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །སྲིད་པ་ཐམས་ཅད་དུ་སྐྱེ་བ་གྲིབ་མ་ལྟ་བུར་གདོང་རབ་ཏུ་སྟོན་ཏོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་སྒྲ་བརྙན་ལྟ་བུར་རབ་ཏུ་ཤེས་སོ། །ཐབས་ཀྱི་ཚུལ་དོན་སྣ་ཚོགས་དང་ལྡན་པ་ལ་རབ་ཏུ་བརྩོན་པས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རབ་ཏུ་བསྟན་པ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པ་ཐོབ་པ་ཡིན་ཏེ།
en: “Noble one, it is when a bodhisattva goes irreversibly to buddha realms because of the radiance of entering the strengths of buddhahood, is irreversible from the ocean of the qualities of a bodhisattva, is never disheartened because of correctly knowing the illusory nature of all phenomena, realizes that all worlds are like dreams, attains the state of perceiving forms as being like reflections, gains the power over miracles through higher cognitions that are like illusory manifestations, teaches that the gateways into rebirths in all existence are like shadows, knows that the wheels of Dharma of all tathāgatas are like echoes, and attains the supreme perfection of teaching the ways of the Dharma through dedication to the ways of methods and various meanings.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བདུན་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱི་འོད་སྣང་བའི་རྒྱན་གྱི་སྙིང་པོ་ཞེས་བྱ་བའོ།
en: “Noble one, that is the seventh birth of a bodhisattva, called the essence of the adorning light that illuminates the strengths of the buddhas

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བརྒྱད་པ་ཡེ་ཤེས་ཀྱི་སྒོ་ཀུན་ནས་རྣམ་པར་དཔྱད་པས་ཡོངས་སུ་འགྲུབ་པ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the eighth birth of a bodhisattva, called the essence of the origin of the accomplishment through the complete analysis of the entrances into knowledge

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་གཞོན་ནུར་གྱུར་ཅིང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དགོད་པ་ལ་རྣམ་པར་གནས་པ་ཡིན་ཏེ། དེ་ལ་གནས་ནས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་ལ་རྣམ་པར་དཔྱོད་དེ།
en: “Noble one, it is when a bodhisattva becomes a youth and maintains the appearance of a bodhisattva and, remaining in that way, analyzes the ways of omniscient knowledge;

source: ཡེ་ཤེས་ཀྱི་ཚུལ་གྱི་སྒོ་རེ་རེ་ལ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ཚད་མྱེད་པ་ཡོངས་སུ་སྟོན་པས་བསྐལ་པ་ཚད་མེད་པ་ཟད་པར་འགྱུར་རོ།
en: manifests measureless fields of bodhisattva activity throughout countless kalpas within each gateway to the ways of knowledge;

source: །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལའང་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པས་དབང་དུ་འགྱུར་ཏེ།
en: attains the ultimate perfection of power over all bodhisattva samādhis;

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་སེམས་ཀྱི་སྐད་ཅིག་ཐམས་ཅད་ལ་ཡང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པ་དག་ན་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཞབས་ཀྱི་དྲུང་དུ་སྐྱེས་ཏེ།
en: in each instant of mind, in all instants of mind, is born in the presence of the tathāgatas who reside in countless buddha realms in the ten directions;

source: དམྱིགས་པ་ཐ་མི་དད་པས་ཐ་མི་དད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་གོ །ཐ་མི་དད་པའི་ཆོས་རྣམས་ལ་ཐ་དད་པའི་ཡེ་ཤེས་ཀྱི་དབང་ཡོངས་སུ་སྟོན་ཏོ།
en: rests in undifferentiated samādhi with undifferentiated foci; manifests the power of undifferentiated knowledge in undifferentiated phenomena;

source: །དམྱིགས་པ་བརྗོད་དུ་མྱེད་པ་དག་ཀྱང་སྒྲིབ་པ་མྱེད་པའི་དབྱིངས་སུ་ནོན་པར་བྱེད་དོ།
en: has arrived at the state without obscuration even though there are infinite objects of perception;

source: །དམིགས་པ་ཆུང་ངུས་ཀྱང་མཐའ་ཡས་པར་བསྟན་པའི་ས་ལ་ཡོངས་སུ་འཇུག་གོ །ཆོས་ཉིད་ཚད་མྱེད་པ་ཡང་ཆུང་བའམ།
en: has entered the level of infinite manifestations through the smallest objects of perception;

source: ཆེ་བར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: discerns endless small and great natures;

source: །འཇིག་རྟེན་ཐམས་ཅད་ཀྱང་རྣམ་པར་དམྱིགས་པ་དང་མཉམ་པར་རབ་ཏུ་རྟོགས་པར་བྱེད་དོ།
en: comprehends all worlds as being the same as mentations;

source: །ཆོས་ཀྱི་དམྱིགས་པ་ཐམས་ཅད་དང་། རྣམ་པར་ཤེས་པའི་རྒྱུད་ཐམས་ཅད་ཀྱང་བསྒོམས་པས་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: and comprehends, through meditation, all perceived phenomena and all the continuums of mentations.

source: །རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བརྒྱད་པ་ཡེ་ཤེས་ཀྱི་སྒོ་ཀུན་ནས་རྣམ་པར་དཔྱད་པས་ཡོངས་སུ་འགྲུབ་པ་འབྱུང་བའི་སྙིང་པོ་ཞེས་བྱ་བའོ།
en: “Noble one, that is the eighth birth of a bodhisattva, called the essence of the origin of the accomplishment through the complete analysis of the entrances into knowledge

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་དགུ་བ་ཆོས་ཀྱི་དབྱིངས་སྤྲུལ་པས་བརྒྱན་པར་བྱེད་པའི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the ninth birth of a bodhisattva, called the essence of the display of emanations throughout the realm of phenomena

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཀྱི་སྐད་ཅིག་ཐམས་ཅད་ལ་རྒྱན་སྣ་ཚོགས་དང་། རྒྱན་དུ་མར་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་བྱིན་གྱིས་རློབ་སྟེ། སྤྲུལ་པ་ཐམས་ཅད་ལ་མི་འཇུག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་དམ་པ་ཐོབ་པ་ཡིན། སངས་རྒྱས་ཀྱི་སྤྲུལ་པ་ཐམས་ཅད་ལ་ཤིན་ཏུ་མཁས་པར་གྱུར་པ་ཡིན། ཆོས་ཀྱི་སྤྲུལ་པ་ལ་མྱི་འཇིགས་པ་རྣམ་པར་དག་པ་ཡིན། ཆོས་ཀྱི་དབྱིངས་དམ་པ་ཆགས་པ་མེད་པའི་སྤྱོད་ཡུལ་དང་ལྡན་པ་ཡིན། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་གྱི་ལུས་རྣམ་པར་དམྱིགས་པར་བྱ་བའི་བྱིན་གྱི་རླབས་ལ་མཁས་པ་ཡིན། སེམས་ཅན་གདུལ་བ་ལ་མཁས་པ་བསམ་གྱིས་མྱི་ཁྱབ་པ་དང་ལྡན་པ་ཡིན།
en: “Noble one, it is when a bodhisattva in each instant of mind consecrates buddha realms with various displays and many displays, attains the ultimate perfection of fearlessness in all manifestations, is skilled in the manifestations of buddhas, has pure fearlessness in the manifestations of the Dharma, possesses an unimpeded field of activity in the realm of the Dharma, is skilled in the empowerment of perceived bodies of beings in accordance with the aspirations of others, has inconceivable skill in guiding beings;

source: སྤྱོད་པ་སྣ་ཚོགས་ཀྱི་མངོན་པར་འཚང་རྒྱ་བ་ཡོངས་སུ་སྟོན་པ་ཡིན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་སྒྲིབ་པ་མྱེད་པ་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ་ཡིན། དེའི་རྒྱུད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལ་མཁས་པ་ཡོངས་སུ་སྟོན་པ་ཡིན། སེམས་ཅན་མཐའ་དང་དབུས་མེད་པ་གདུལ་བའི་ཐབས་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ་ཡིན། རྣམ་པར་སྣང་མཛད་ཀྱི་ཡེ་ཤེས་དབྱིག་ཏུ་བྱ་བའི་མཛོད་དང་ལྡན་པས་སེམས་ཅན་གདུལ་བའི་དུས་ལ་བབ་ན་རྟག་ཏུ་སྟ་གོན་དུ་གནས་པ་ཡིན་ཏེ།
en: manifests buddhahood through various kinds of conduct, is skilled in accomplishing the unobscured path to omniscience and thereupon manifests skill in turning the wheel of the Dharma, is skilled in accomplishing methods for guiding a vast extent of beings without end or middle, and is always prepared for guiding beings when the time has come through the treasure of a wealth of illuminating wisdom.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་དགུ་པ་ཆོས་ཀྱི་དབྱིངས་སྤྲུལ་པས་བརྒྱན་པ་བྱེད་པའི་སྙིང་པོ་ཞེས་བྱའོ།
en: “Noble one, that is the ninth birth of a bodhisattva, called the essence of the display of emanations throughout the realm of phenomena

source: །རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བཅུ་པ་དེ་བཞིན་གཤེགས་པའི་ས་ཡོངས་སུ་གནོན་པའི་ཤུགས་དྲག་པོའི་སྙིང་པོ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: “Noble one, what is the tenth birth of a bodhisattva, called the essence of the power of ascending to the level of the tathāgatas

source: འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་། རང་བཞིན་གཅིག་པའི་ཡུལ་ལ་དབང་བསྐུར་བ་ཡིན་ཏེ།
en: “Noble one, it is when a bodhisattva is established in the field that is the single nature of all the tathāgatas in the three times;

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་འདབ་ཆགས་པའི་ཡུལ་ལ་རབ་ཏུ་འཇུག་པ་ཡིན།
en: comprehends the field of the succession of all world realms;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའི་ཤི་འཕོ་དང་། སྐྱེ་བའི་སེམས་རྒྱུད་ཆགས་པར་འབྱུང་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: knows the successive arising of the minds of all beings in their deaths and rebirths in the past and in the future;

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་འདབ་ཆགས་པའི་ཡུལ་ཡང་རབ་ཏུ་ཤེས་སོ། །འདས་པ་དང་མ་བྱོན་པ་དང་དེ་ལྟར་བྱུང་བའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འདབ་ཆགས་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: knows the fields of the successive conduct and knowledge of all bodhisattvas; knows the successive attainment of buddhahood of all the buddhas in the past, future, and present;

source: །ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུད་འདབ་ཆགས་པ་ལ་མཁས་པར་བྱ་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: knows the successive skillfulness in the presentation of all the Dharma;

source: །བསྐལ་པ་འཇིག་པ་དང་འདུ་བ་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་ད་ལྟར་བྱུང་བ་རྣམས་ཀྱང་མྱིང་དང་བཅས། ས་ཚིགས་དང་བཅས་པར་འདབ་ཆགས་པར་རབ་ཏུ་ཤེས་སོ།
en: knows the successive destruction and formation of all kalpas in the past, future, and present, together with their names and their details;

source: །སེམས་ཅན་ཚུལ་ཇི་ལྟ་བུར་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ་དང་། དུས་ལ་གང་དུ་བབ་པ་རྣམས་ལ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་རྒྱན་དང་། རྣམ་པར་འཚང་རྒྱ་བས་གདུལ་བར་བྱ་བ་ཡོངས་སུ་བསྟན་པའི་བྱིན་གྱི་རླབས་ཀྱི་ཡེ་ཤེས་ཀྱང་མངོན་པར་སྒྲུབ་བོ།
en: attains the knowledge of the blessing that manifests the field of the display and enlightenment of buddhahood when the appropriate time has come for ripening beings in the appropriate way;

source: །སངས་རྒྱས་བྱུང་བ་ཐམས་ཅད་མངོན་པར་འཚང་རྒྱ་བའི་དྲུང་དུ་ཉེ་བར་འགྲོ་ཞིང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལ་མཁས་པའི་ཚུལ་འདབ་ཆགས་པ་ཡང་། སེམས་ཅན་གྱི་ཁམས་མཐའ་དང་དབུས་མེད་པ་གདུལ་བའི་ཐབས་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པས་ཡོངས་སུ་སྟོན་ཏེ།
en: and manifests the successive ways of the skill in turning the wheel of the Dharma on approaching the appearance and enlightenment of all buddhas through skill in accomplishing the methods for guiding a vast extent of realms of beings without end or middle.

source: རིགས་ཀྱི་བུ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བཅུ་བ་དེ་བཞིན་གཤེགས་པའི་ས་ཡོངས་སུ་གནོན་པའི་ཤུགས་དྲག་པོའི་སྙིང་པོ་ཞེས་བྱ་བའོ། །རིགས་ཀྱི་བུ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་བཅུ་རྣམས་ཏེ། དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སྐྱེ་བར་འགྱུར་བའོ། །འབྱུང་བར་འགྱུར་བའོ།
en: “Noble one, that is the tenth birth of a bodhisattva, called the essence of the power of ascending to the level of the tathāgatas

source: །ཡང་དག་པར་སྒྲུབ་པར་བྱེད་པའོ། །ཡང་དག་པར་འཕེལ་བར་བྱེད་པའོ། །རབ་ཏུ་རྫོགས་པར་བྱེད་པའོ། །ཡོངས་སུ་གྲུབ་པར་བྱེད་པའོ། །ཞིང་མ་ལུས་པ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་རྒྱན་གཅིག་གི་ལྷབ་ལྷུབ་ལ་རྒྱན་དང་། ལྷབ་ལྷུབ་ཀྱི་རྒྱུད་རྣམ་པ་སྣ་ཚོགས་ཀྱི་བྱིན་གྱིས་རློབ་པའོ།
en: “Noble one, those are the ten births of the bodhisattvas, through which the bodhisattvas are born, appear, attain, increase, complete, and accomplish. They manifest various adornments, an array of adornments through a single display so as to be comprehended in all realms without exception.

source: །སེམས་ཅན་གྱི་ཁམས་གདུལ་བ་རྒྱུན་མི་གཅད་པའི་ཕྱིར་ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་བྱིན་གྱི་རླབས་ཀྱིས་རྒྱུན་འཆད་པ་མྱེད་པར་བྱེད་པའོ།
en: They create manifestations continuously in order to continuously guide the realm of beings until the end of all future kalpas.

source: །ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་དམྱིགས་པ་སྣ་ཚོགས་དང་། ཤིན་ཏུ་བསྟན་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་སྣ་ཚོགས་དུ་མ་རྣམ་པ་ཐ་དད་པ་དང་། ཆོས་མཐའ་ཡས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་རྒྱུན་མངོན་པར་འཚང་རྒྱ་བར་བྱེད་པའོ། །སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱིས་ཀླས་པ། ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་གཏུགས་པ་ཡོངས་སུ་སྟོན་པའོ།
en: They are realized concerning the various perceptions of an ocean of all the Dharmas, the many various different lineages of the teachings, and the successive transmission of endless Dharmas. They manifest the inconceivable supremacy of buddhahood throughout the realm of phenomena and to the ends of space.

source: །སེམས་ཅན་ཚད་མེད་པ་སྤྱོད་པ་རྒྱ་མཚོ་སྣ་ཚོགས་དང་ལྡན་པ་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བས་ཡོངས་སུ་འདུལ་བ་རྣམས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ཡོངས་སུ་བསྟན་པའོ།
en: They manifest turning the wheel of the Dharma in ripening, guiding, and caring for an immeasurable ocean of beings with various conducts.

source: །སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་སངས་རྒྱས་འབྱུང་བ་དང་མི་འབྲལ་བར་བྱིན་གྱིས་རློབ་པའོ།
en: They manifest the appearance of buddhas in all the realms of beings.

source: །ཆོས་ཐམས་ཅད་ཀྱི་སྤྲིན་དབྱངས་ཀྱི་ཡན་ལག་རྒྱ་མཚོ་བརྗོད་དུ་མེད་པས་རྣམ་པར་དག་པ་དམྱིགས་པ་ཐམས་ཅད་ལས་རབ་ཏུ་འབྱུང་བ་རྣམ་པར་དམྱིགས་པར་བྱེད་པའོ།
en: They perceive the arising within all perceptions of the purity of an indescribable ocean of the aspects of speech of the clouds of all Dharmas.

source: །ཚད་མེད་པར་རྣམ་པར་སྤྱོད་པ་ལ་བསྒྲིབས་པ་མེད་པར་རྟོགས་པས་ཁོང་དུ་ཆུད་པ་རྣམས་ཆོས་ཡིད་དུ་འོང་བའི་རྒྱན་ཐམས་ཅད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའི་དཀྱིལ་འཁོར་བསམ་པ་དང་། མོས་པ་གང་དང་ལྡན་པའི་ཚུལ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཡོངས་སུ་སྟོན་པའོ།
en: They have realized measureless, unobscured activities and manifest the bodhisattva field that has the display of the entire, beautiful Dharma. They teach beings in accordance with their aspirations and wishes.

source: །སངས་རྒྱས་ཀྱིས་ཚད་མེད་པའི་རྗེས་སུ་སོང་བ་རྣམས་འཇིག་རྟེན་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པའི་དོན་དུ་ཆོས་ཀྱི་མཛོད་མཐའ་དང་དབུས་མེད་པ་རབ་ཏུ་སྟོན་པའོ།
en: They teach vast Dharma without end or middle so that all worlds may accomplish the approach to measureless buddhahood.”

source: །དེ་ནས་ལུམ་བི་ནིའི་ནགས་ཚལ་གྱི་ལྷ་མོ་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་བཟང་པོས་དགའ་བའི་དཔལ་གྱིས། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་དོན་འདི་ཉིད་གསལ་བར་བརྗོད་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then at that time, the Lumbinī Forest goddess Sutejomaṇḍala­rati­śrī, in order to elucidate the meaning of this bodhisattva Dharma, through the blessing of the Buddha gazed into the ten directions and then recited these verses to Sudhana, the head merchant’s son:

source: ལྷག་པའི་བསམ་པ་དྲི་མེད་རྙོག་པ་མེད་པ་ཡིས།
en: “Those who, with stainless, unalloyed higher motivation,

source: །གང་རྣམས་རྒྱལ་བ་བལྟ་བས་ནམ་ཡང་མི་ངོམས་ཤིང་།
en: Never have enough of gazing upon the jinas,

source: །རྒྱལ་བ་ཀུན་གྱི་ཕྱི་མའི་མཐའ་ཡི་རྒྱན་སྤྲིན་ལ།
en: The wise ones who pray for all-pervading clouds

source: །སྨོན་པའི་མཁས་པ་དེ་དག་སྐྱེ་བའི་ཐོག་མ་གནས།
en: Of displays for all the jinas, are in their first birth.

source: །དུས་གསུམ་བྱུང་བའི་འཇིག་རྟེན་མ་ལུས་ཀུན་བཀང་སྟེ།
en: “Those who pervade, without exception, all worlds, realms,

source: །ཞིང་དང་སེམས་ཅན་དེ་བཞིན་ཆོས་དང་སངས་རྒྱས་རྣམས།
en: Beings, and also the Dharma and buddhas in the three times,

source: །སེམས་ཅན་དགྲོལ་ཕྱིར་སྨོན་ལམ་འདེབས་པས་བརྒྱན་པའི་སེམས།
en: Whose minds are adorned by the prayer to liberate beings—

source: །དེ་ནི་བསམ་གྱིས་མྱི་ཁྱབ་རྣམས་ཀྱི་སྐྱེ་བ་གཉིས།
en: They are in their inconceivable second birth.

source: །གང་རྣམས་ཆོས་ཀྱི་སྤྲིན་འཐུང་ནམ་ཡང་མི་ངོམས་ཤིང་།
en: “Those who never have enough of drinking the clouds of the Dharma,

source: །ངེས་པར་རྟོགས་པའི་ཡིད་ཀྱིས་དུས་གསུམ་ཆགས་མེད་ལུས།
en: Who have unimpeded bodies in the three times, and minds with definitive realization,

source: །མཁའ་དབྱིངས་དྲི་མེད་མཉམ་མེད་སེམས་ཀྱི་ལུས་ལྡན་པ།
en: Who have mental bodies that are as stainless as the realm of space—

source: །མཚུངས་པ་མེད་པ་དེ་ནི་དེ་དག་སྐྱེ་བ་གསུམ།
en: They are in this third birth that is unequaled.

source: །ལྷག་པའི་བསམ་པ་རི་རབ་རྡོ་རྗེ་མཚུངས་བསྟན་པས།
en: “Those who with a higher motivation, like Sumeru , as firm as a vajra,

source: །ཐམས་ཅད་མཁྱེན་ཚུལ་རྒྱ་མཚོར་རྣམ་པར་འཇུག་བྱེད་ཅིང་།
en: Are entering the ocean of the ways of omniscience,

source: །གང་རྣམས་སྙིང་རྗེ་ཆེན་པོའི་གང་ཆེན་མཚོར་འཇུག་པ།
en: Who enter into the ocean of great compassion—

source: །དེ་ནི་སྐྱེས་བུ་ཁྱུ་མཆོག་རྣམས་ཀྱི་སྐྱེ་བ་བཞི།
en: They, supreme among humans, are in their fourth birth.

source: །གང་རྣམས་བྱམས་པས་ཕྱོགས་བཅུ་རྒྱས་པར་ཡོངས་བཀང་ཞིང་།
en: “They who pervade the ten directions with love,

source: །ཕ་རོལ་ཕྱིན་པ་དྲི་མེད་རྒྱ་མཚོ་མངོན་བསྒྲུབས་ཏེ།
en: Who accomplish an ocean of stainless perfections,

source: །ཆོས་ཀྱི་འོད་འགྱེད་འགྲོ་བ་ཡོངས་སུ་སྨྱིན་བྱེད་པ།
en: Who radiate the light of the Dharma and ripen beings—

source: །དེ་ནི་སྐྱེས་བུ་ཆེན་པོ་དེ་དག་སྐྱེ་བ་ལྔ།
en: They are in the fifth birth of great beings.

source: །ཆོས་ཀྱི་རང་བཞིན་རབ་ཏུ་རྟོགས་པས་ཆགས་མེད་སེམས།
en: “They who having realized the nature of phenomena have unimpeded minds,

source: །དུས་གསུམ་དཔེ་ཟླ་མེད་པའི་སངས་རྒྱས་རིགས་བྱུང་ཞིང་།
en: Who are born into the family of the buddhas unequaled in the three times,

source: །གང་རྣམས་ཆོས་དབྱིངས་རྒྱ་མཚོའི་ཚུལ་ལ་འཇུག་བྱེད་པ།
en: Who enter into the ocean of the ways of the realm of the Dharma—

source: །འདི་ནི་མཁས་པ་དེ་དག་སྐྱེ་བ་ཡངས་པ་དྲུག །གང་རྣམས་ཆོས་ལུས་ཡོངས་དག་ཆགས་པ་མེད་པའི་སེམས།
en: They are in this sixth birth of those who have wisdom. “Those who have a completely pure Dharma body and an unimpeded mind,

source: །ཞིང་རྣམས་མ་ལུས་རང་གི་ལུས་ཀྱིས་དགང་བྱས་ཤིང་།
en: Who with their own bodies pervade all realms without exception,

source: །སངས་རྒྱས་སྟོབས་རྣམས་མ་ལུས་ཁོང་དུ་ཆུད་རྟོགས་པ།
en: Who have gained the realization of all the strengths, without exception, of the buddhas—

source: །དེ་ནི་མཁས་པ་རྣམས་ཀྱི་སྐྱེ་བ་བསམ་ཡས་བདུན།
en: They are in the inconceivable seventh birth of the wise ones.

source: །གང་རྣམས་ཡེ་ཤེས་རྒྱ་མཚོའི་ཚུལ་ལ་དབང་ལྡན་ཞིང་།
en: “Those who have dominion over the ways of an ocean of knowledge,

source: །ཐམས་ཅད་མཁྱེན་པའི་སྒོ་ཚུལ་རྣམ་པར་དཔྱོད་བྱེད་ལ།
en: Who analyze the ways of the entrances into omniscience,

source: །ཏིང་འཛིན་ཀུན་ཚུལ་གང་ཆེན་མཚོ་ལ་ཡོངས་འཇུག་པ།
en: Who enter into an ocean of the ways of all samādhis—

source: །དེ་ནི་དེ་བཞིན་ཉིད་རྟེན་རྣམས་ཀྱི་སྐྱེ་བ་བརྒྱད།
en: They are in the eighth birth of those who rely on the true nature.
